<?PHP
//error_reporting(E_ALL ^ E_NOTICE);
chdir('../');
include('api/Simpla.php');

setlocale(LC_ALL, "ru_RU.UTF-8");

//SELECT * FROM `s_variants` v LEFT JOiN `s_products_categories` c ON v.product_id = c.product_id WHERE c.category_id='143' AND v.price >= "7500";

function process_sale($name)
{
    $simpla = new Simpla();
    $simpla->db->query('SELECT * FROM __products WHERE name=? ', $name);
    $result = $simpla->db->result("name");
    if (!$result) {
        $result = "Такого товара не существует!<br/>";
        return $result;
    }
    $img_name = "podarok.png";
    if($result) {
        $simpla->db->query('UPDATE __products SET attachment_files_one=? WHERE name=?', $img_name, $name);
        $result_2 = $simpla->db->results();
        if (is_array($result_2)) {
            $result .= " <strong style='color:green'>флаг добавлен</strong>";
        }
        else
            $result .= " <strong style='color:red'>флаг не добавлен</strong>";
    }
    return $result;
}

$list = array(
    "Детский Спорт Комплекс Карусель 2, зелено-желтый",
    "Детский Спортивный Комплекс Детский уголок",
    "Детский Спорт Комплекс Карусель S1,белое золото",
    "Детский Спортивный Комплекс KIDWOOD березка",
    "Детский Спорт Комплекс Комета 1,зелено-желтый",
    "Детский Спорт Комплекс Комета 1,сине-желтый",
    "Детский Спорт Комплекс Комета5, белое золото",
    "Детский Спорт Комплекс Комета5, зелено-желтый",
    "Детский Спорт Комплекс Комета5, красно-желтый",
    "Детский Спорт Комплекс Комета5, сине-желтый",
    "Детский Спорт Комплекс Комета NEXT 1,красно-желтый",
    "Детский Спорт Комплекс Комета NEXT 1,белое золото",
    "Детский Спорт Комплекс Комета NEXT 1,зелено-желтый",
    "Детский Спорт Комплекс Комета NEXT 1,сине-желтый",
    "ДСКМ \"Комета next 1\" сине-желтый 410",
    "Детский Спортивный Комплекс Комета Next 3",
    "Детский Спорт Комплекс Тинейджер R8-1,белое золото",
    "Детский Спорт Комплекс Тинейджер S8-1,белое золото",
    "Детский Спортивный Комплекс Карусель R5",
    "Детский Спорт Комплекс Карусель S1,белое золото",
    "Детский Спорт Комплекс Карусель S1,зелено-желтый",
    "Детский Спорт Комплекс Карусель S1,сине-желтый",
    "Детский Спорт Комплекс Карусель S1,Эконом,зел-желт",
    "Детский Спорт Комплекс Карусель S1,Эконом,крас-жел",
    "Детский Спорт Комплекс Карусель S1,Эконом,сине-жел",
    "Детский Спортивный Комплекс Карусель S3",
    "Детский Спортивный Комплекс Комета 2 Зелено-желтый",
    "Детский Спортивный Комплекс Комета 2 Сине-желтый",
    "Детский Спорт Комплекс Тинейджер S8-2,белое золото",
    "Детский Спорт Комплекс Тинейджер R8-2,белое золото",
    "Детский Спортивный Комплекс Пионер",
);

foreach($list as $name) {
    echo "<pre>";
    print_r(process_sale($name));
    echo "</pre>";
}
